## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.download_grants_gov_db.aws_iam_role.scheduler_execution[0] has changed
  ~ resource "aws_iam_role" "scheduler_execution" {
        id                    = "grants_ingest-staging-scheduler_exec20230327160725268500000001"
        name                  = "grants_ingest-staging-scheduler_exec20230327160725268500000001"
        tags                  = {}
        # (11 unchanged attributes hidden)

+       inline_policy {
+           name   = "terraform-20230327214441701200000001"
+           policy = jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = "lambda:InvokeFunction"
+                           Effect   = "Allow"
+                           Resource = [
+                               "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:*",
+                               "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB",
                            ]
+                           Sid      = "AllowInvokeLambda"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            )
        }
    }

  # module.download_grants_gov_db.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-03-27T21:44:29.752+0000" -> "2023-03-27T21:44:42.333+0000"
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.split_grants_gov_db.aws_s3_bucket_notification.default will be created
+   resource "aws_s3_bucket_notification" "default" {
+       bucket      = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       eventbridge = false
+       id          = (known after apply)

+       lambda_function {
+           events              = [
+               "s3:ObjectCreated:*",
            ]
+           filter_prefix       = "sources/"
+           filter_suffix       = "/grants.gov/extract.xml"
+           id                  = (known after apply)
+           lambda_function_arn = (known after apply)
        }
    }

  # module.download_grants_gov_db.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-03-27T21:44:42.333+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:1/invocations" -> (known after apply)
      ~ s3_key                         = "builds/b0b4d8f8917c755863a1a8f51a57a3bd01cc78611b91ff1a747daa3387e40ec0.zip" -> "builds/b1da4a9a2bf329ecdb12ab4fe1bf91e24d57c078ce95c71e0c82457079d7f2b1.zip"
      ~ s3_object_version              = "7maikhY9jyFwuMPASlgQXSUvojiFjV_g" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_VERSION"                     = "0d4b801575189dd4c65df8c50a28637fefa083b2" -> "143d6bc9075aefe3bb0b10055c60db3abca31d4d"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.download_grants_gov_db.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "1" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.download_grants_gov_db.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "720c6d7abb1e4bdb31e889a0e0934e2a-2" -> (known after apply)
      ~ id                     = "builds/b0b4d8f8917c755863a1a8f51a57a3bd01cc78611b91ff1a747daa3387e40ec0.zip" -> (known after apply)
      ~ key                    = "builds/b0b4d8f8917c755863a1a8f51a57a3bd01cc78611b91ff1a747daa3387e40ec0.zip" -> "builds/b1da4a9a2bf329ecdb12ab4fe1bf91e24d57c078ce95c71e0c82457079d7f2b1.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/b0b4d8f8917c755863a1a8f51a57a3bd01cc78611b91ff1a747daa3387e40ec0.zip" -> "builds/b1da4a9a2bf329ecdb12ab4fe1bf91e24d57c078ce95c71e0c82457079d7f2b1.zip"
-       tags                   = {} -> null
      ~ version_id             = "7maikhY9jyFwuMPASlgQXSUvojiFjV_g" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.download_grants_gov_db.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-download_grants_gov_db
                            cd bin/download_grants_gov_db
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/b1da4a9a2bf329ecdb12ab4fe1bf91e24d57c078ce95c71e0c82457079d7f2b1.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/b1da4a9a2bf329ecdb12ab4fe1bf91e24d57c078ce95c71e0c82457079d7f2b1.plan.json"
+       id                   = (known after apply)
    }

  # module.download_grants_gov_db.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5228358038612615785" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b0b4d8f8917c755863a1a8f51a57a3bd01cc78611b91ff1a747daa3387e40ec0.zip" -> "builds/b1da4a9a2bf329ecdb12ab4fe1bf91e24d57c078ce95c71e0c82457079d7f2b1.zip"
          ~ "timestamp" = "1679953384215210000" -> "1679963113837043000"
        }
    }

  # module.download_grants_gov_db.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6368745892582310042" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/b0b4d8f8917c755863a1a8f51a57a3bd01cc78611b91ff1a747daa3387e40ec0.zip" -> "builds/b1da4a9a2bf329ecdb12ab4fe1bf91e24d57c078ce95c71e0c82457079d7f2b1.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.split_grants_gov_db.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
        }
    }

  # module.split_grants_gov_db.module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
+   resource "aws_cloudwatch_log_group" "lambda" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/aws/lambda/grants_ingest-staging-SplitGrantsGovXMLDB"
+       name_prefix       = (known after apply)
+       retention_in_days = 30
+       skip_destroy      = false
+       tags_all          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.split_grants_gov_db.module.lambda_function.aws_iam_policy.additional_json[0] will be created
+   resource "aws_iam_policy" "additional_json" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "grants_ingest-staging-SplitGrantsGovXMLDB"
+       path      = "/"
+       policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "secretsmanager:GetSecretValue"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
+                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
+                   {
+                       Action   = [
+                           "s3:ListBucket",
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::grantsingest-staging-grantsprepareddata-357150818708-us-west-2/*/*/grants.gov/v2.xml",
+                           "arn:aws:s3:::grantsingest-staging-grantsprepareddata-357150818708-us-west-2",
                        ]
+                       Sid      = "AllowInspectS3PreparedData"
                    },
+                   {
+                       Action   = "s3:GetObject"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/sources/*/*/*/grants.gov/extract.xml"
+                       Sid      = "AllowS3DownloadSourceData"
                    },
+                   {
+                       Action   = "s3:PutObject"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::grantsingest-staging-grantsprepareddata-357150818708-us-west-2/*/*/grants.gov/v2.xml"
+                       Sid      = "AllowS3UploadPreparedData"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id = (known after apply)
+       tags_all  = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.split_grants_gov_db.module.lambda_function.aws_iam_policy.logs[0] will be created
+   resource "aws_iam_policy" "logs" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "grants_ingest-staging-SplitGrantsGovXMLDB-logs"
+       path      = "/"
+       policy    = (known after apply)
+       policy_id = (known after apply)
+       tags_all  = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.split_grants_gov_db.module.lambda_function.aws_iam_role.lambda[0] will be created
+   resource "aws_iam_role" "lambda" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "grants_ingest-staging-SplitGrantsGovXMLDB"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.split_grants_gov_db.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0] will be created
+   resource "aws_iam_role_policy_attachment" "additional_json" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-SplitGrantsGovXMLDB"
    }

  # module.split_grants_gov_db.module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be created
+   resource "aws_iam_role_policy_attachment" "logs" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-SplitGrantsGovXMLDB"
    }

  # module.split_grants_gov_db.module.lambda_function.aws_lambda_function.this[0] will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = [
+           "arm64",
        ]
+       arn                            = (known after apply)
+       description                    = "Creates per-grant XML data files from a source Grants.gov XML DB extract."
+       function_name                  = "grants_ingest-staging-SplitGrantsGovXMLDB"
+       handler                        = "bootstrap"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = [
+           "arn:aws:lambda:us-west-2:464622532012:layer:Datadog-Extension-ARM:38",
        ]
+       memory_size                    = 1024
+       package_type                   = "Zip"
+       publish                        = true
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "provided.al2"
+       s3_bucket                      = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       s3_key                         = "builds/af0ab77b71ffcd03f9dfd48dbee4576caa946391b9fb2db1f4d863b2cb6b632c.zip"
+       s3_object_version              = (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       timeout                        = 300
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "DD_API_KEY_SECRET_ARN"            = (sensitive value)
+               "DD_APM_ENABLED"                   = "true"
+               "DD_CAPTURE_LAMBDA_PAYLOAD"        = "true"
+               "DD_ENV"                           = "staging"
+               "DD_SERVERLESS_APPSEC_ENABLED"     = "true"
+               "DD_SERVICE"                       = "grants-ingest"
+               "DD_SITE"                          = "datadoghq.com"
+               "DD_TRACE_ENABLED"                 = "true"
+               "DD_TRACE_RATE_LIMIT"              = "1000"
+               "DD_VERSION"                       = "143d6bc9075aefe3bb0b10055c60db3abca31d4d"
+               "DOWNLOAD_CHUNK_LIMIT"             = "20"
+               "GRANTS_PREPARED_DATA_BUCKET_NAME" = "grantsingest-staging-grantsprepareddata-357150818708-us-west-2"
+               "GRANTS_SOURCE_DATA_BUCKET_NAME"   = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+               "LOG_LEVEL"                        = "INFO"
+               "MAX_CONCURRENT_UPLOADS"           = "10"
+               "S3_USE_PATH_STYLE"                = "true"
+               "TZ"                               = "UTC"
            }
        }

+       ephemeral_storage {
+           size = 512
        }

+       tracing_config {
+           mode = (known after apply)
        }
    }

  # module.split_grants_gov_db.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-SplitGrantsGovXMLDB"
+       id                  = (known after apply)
+       principal           = "s3.amazonaws.com"
+       qualifier           = (known after apply)
+       source_arn          = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       statement_id        = "S3BucketNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.split_grants_gov_db.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"] will be created
+   resource "aws_lambda_permission" "unqualified_alias_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-SplitGrantsGovXMLDB"
+       id                  = (known after apply)
+       principal           = "s3.amazonaws.com"
+       source_arn          = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       statement_id        = "S3BucketNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.split_grants_gov_db.module.lambda_function.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "builds/af0ab77b71ffcd03f9dfd48dbee4576caa946391b9fb2db1f4d863b2cb6b632c.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "builds/af0ab77b71ffcd03f9dfd48dbee4576caa946391b9fb2db1f4d863b2cb6b632c.zip"
+       storage_class          = "ONEZONE_IA"
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.split_grants_gov_db.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-split_grants_gov_xml_db
                            cd bin/split_grants_gov_xml_db
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/af0ab77b71ffcd03f9dfd48dbee4576caa946391b9fb2db1f4d863b2cb6b632c.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/af0ab77b71ffcd03f9dfd48dbee4576caa946391b9fb2db1f4d863b2cb6b632c.plan.json"
+       id                   = (known after apply)
    }

  # module.split_grants_gov_db.module.lambda_function.null_resource.archive[0] will be created
+   resource "null_resource" "archive" {
+       id       = (known after apply)
+       triggers = {
+           "filename"  = "builds/af0ab77b71ffcd03f9dfd48dbee4576caa946391b9fb2db1f4d863b2cb6b632c.zip"
+           "timestamp" = "1679963114061276000"
        }
    }

  # module.split_grants_gov_db.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] will be created
+   resource "null_resource" "sam_metadata_aws_lambda_function" {
+       id       = (known after apply)
+       triggers = {
+           "built_output_path"    = "builds/af0ab77b71ffcd03f9dfd48dbee4576caa946391b9fb2db1f4d863b2cb6b632c.zip"
+           "original_source_code" = jsonencode(
                [
+                   {
+                       commands = [
+                           "task build-split_grants_gov_xml_db",
+                           "cd bin/split_grants_gov_xml_db",
+                           ":zip",
                        ]
+                       path     = "./.."
                    },
                ]
            )
+           "resource_name"        = "aws_lambda_function.this[0]"
+           "resource_type"        = "ZIP_LAMBDA_FUNCTION"
+           "source_code_property" = "path"
        }
    }

Plan: 19 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  ~ lambda_functions = [
        "grants_ingest-staging-DownloadGrantsGovDB",
+       "grants_ingest-staging-SplitGrantsGovXMLDB",
    ]
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4537898792)*